If true, units are shown in the legend.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public bool ShowUnits { get; set; }
  Visual Basic
Public Property ShowUnits As Boolean
	Get
	Set
  Visual C++
public:
property bool ShowUnits {
	bool get ();
	void set (bool value);
}
 See Also
  AnalysisDisplayLegendSettings Class
  Autodesk.Revit.DB.Analysis Namespace